In [2]:
from sklearn import tree
import pandas as pd
import os

In [3]:
df = pd.read_csv("../data/cc_outliers_dataset.csv")
df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS,STATUS
0,5008804,1,1,1,0,427500,4,1,0,4,12005,4542,1,1,0,0,2,1
1,5008805,1,1,1,0,427500,4,1,0,4,12005,4542,1,1,0,0,2,1
2,5008806,1,1,1,0,112500,4,4,1,1,21474,1134,1,0,0,0,2,0
3,5008808,0,0,1,0,270000,0,4,3,1,19110,3051,1,0,1,1,1,0
4,5008809,0,0,1,0,270000,0,4,3,1,19110,3051,1,0,1,1,1,0

In [4]:
target = df["STATUS"]
target_names = ["approved", "approved", "rejected", "rejected", "rejected", "rejected"]
target.value_counts()

0    31743
1     3631
2      306
5      178
3       73
4       46
Name: STATUS, dtype: int64

In [5]:
data = df.drop(["STATUS", "ID", "FLAG_MOBIL"], axis=1)
feature_names = data.columns
data.head()

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
0,1,1,1,0,427500,4,1,0,4,12005,4542,1,0,0,2
1,1,1,1,0,427500,4,1,0,4,12005,4542,1,0,0,2
2,1,1,1,0,112500,4,4,1,1,21474,1134,0,0,0,2
3,0,0,1,0,270000,0,4,3,1,19110,3051,0,1,1,1
4,0,0,1,0,270000,0,4,3,1,19110,3051,0,1,1,1

In [6]:
# Split the data using train_test_split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data, target, random_state=42)

In [7]:
# Create a Decision Tree Classifier
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X_train, y_train)
clf.score(X_test, y_test)

0.8718176764869372

In [8]:
# Fit the classifier to the data
from sklearn.ensemble import RandomForestClassifier
rf =RandomForestClassifier(n_estimators = 200)
rf =rf.fit(X_train, y_train)
rf.score(X_test, y_test)

0.8793774319066148

In [8]:
# Create, fit, and score a Random Forest Classifier
sorted(zip(rf.feature_importances_, feature_names), reverse=True)

[(0.2857193908115151, 'DAYS_BIRTH'),
 (0.21517035126470055, 'DAYS_EMPLOYED'),
 (0.1852472730681579, 'AMT_INCOME_TOTAL'),
 (0.04298931720040688, 'NAME_FAMILY_STATUS'),
 (0.03663813765792596, 'NAME_INCOME_TYPE'),
 (0.034986424448499254, 'NAME_EDUCATION_TYPE'),
 (0.028533175619397586, 'CNT_FAM_MEMBERS'),
 (0.02494898295751054, 'FLAG_OWN_CAR'),
 (0.024253767813835092, 'FLAG_PHONE'),
 (0.023913265562676523, 'NAME_HOUSING_TYPE'),
 (0.02225686609388161, 'CODE_GENDER'),
 (0.021560275030849535, 'FLAG_WORK_PHONE'),
 (0.020449847010078653, 'FLAG_OWN_REALTY'),
 (0.018881198505248387, 'CNT_CHILDREN'),
 (0.014451726955316508, 'FLAG_EMAIL')]

In [9]:
from sklearn.metrics import classification_report
prediction = rf.predict(X_test) 
print(classification_report(prediction, y_test, target_names = target_names))

              precision    recall  f1-score   support

    approved       0.96      0.91      0.93      8412
    approved       0.27      0.48      0.35       510
    rejected       0.13      0.31      0.18        36
    rejected       0.06      0.20      0.09         5
    rejected       0.21      0.50      0.30         6
    rejected       0.18      0.31      0.23        26

    accuracy                           0.88      8995
   macro avg       0.30      0.45      0.35      8995
weighted avg       0.92      0.88      0.90      8995